# functions

In [1]:
def add(a,b,c):
    return a+b+c

In [2]:
l1=(1,2,3)
l2=(2,3,4)
l3=(2,3,4)

In [3]:
list(map(add,(l1),(l2),(l3)))

[5, 8, 11]

In [4]:
def subtract(a,b):
    return a-b
l1=(1,2,3)
l2=(2,3,4)

In [5]:
list(map(subtract,(l1),(l2)))

[-1, -1, -1]

In [6]:
def divide(a,b):
    return a/b
l1=(1,2,3)
l2=(2,3,4)

In [7]:
list(map(divide,(l1),(l2)))

[0.5, 0.6666666666666666, 0.75]

In [8]:
def mult(a,b):
    return a*b
l1=(1,2,3)
l2=(2,3,4)

In [9]:
list(map(mult,(l1),(l2)))

[2, 6, 12]

In [11]:
def power(a,b):
    return a**b
l1=(1,2,3)
l2=(2,3,4)

In [12]:
list(map(power,(l1),(l2)))

[1, 8, 81]

In [13]:
def power1(a):
    return a**2
l1=(1,2,3)

In [14]:
list(map(power1,(l1)))

[1, 4, 9]

In [15]:
def to_forn(c):
    return 9/5*c+32
l1=(35,38,40)

In [16]:
list(map(to_forn,(l1)))

[95.0, 100.4, 104.0]

In [17]:
def to_celc(f):
    return (f-32)*5/9
l1=(35,38,40)

In [18]:
list(map(to_celc,(l1)))

[1.6666666666666667, 3.3333333333333335, 4.444444444444445]

In [19]:
def power2(x):
    return x**2,x**3,x**4
l1=(2,3,4)

In [20]:
list(map(power2,(l1)))

[(4, 8, 16), (9, 27, 81), (16, 64, 256)]

In [21]:
s=["pakistan","peshawar","charsadda","mardan","multan"]
list(map(list,(s)))

[['p', 'a', 'k', 'i', 's', 't', 'a', 'n'],
 ['p', 'e', 's', 'h', 'a', 'w', 'a', 'r'],
 ['c', 'h', 'a', 'r', 's', 'a', 'd', 'd', 'a'],
 ['m', 'a', 'r', 'd', 'a', 'n'],
 ['m', 'u', 'l', 't', 'a', 'n']]

In [22]:
import pandas as pd
import numpy as np

In [23]:
df=pd.read_csv("dataset.csv")
df

  category  items    size  price
0        a    two   large   3000
1        b  three   large   2000
2        a   four  medium   1500
3        b    two  medium   1000
4        a  three   small    800
5        b   four   small    400
6        a    two   large   2500

In [25]:
t=pd.pivot_table(df,values='price',index=['category','items'],columns=['size'],aggfunc=np.sum)

In [26]:
print(t)

size             large  medium  small
category items
a        four      NaN  1500.0    NaN
         three     NaN     NaN  800.0
         two    5500.0     NaN    NaN
b        four      NaN     NaN  400.0
         three  2000.0     NaN    NaN
         two       NaN  1000.0    NaN

In [27]:
t=pd.pivot_table(df,values='price',index=['category','items'],columns=['size'],aggfunc=np.mean)
t

size             large  medium  small
category items
a        four      NaN  1500.0    NaN
         three     NaN     NaN  800.0
         two    2750.0     NaN    NaN
b        four      NaN     NaN  400.0
         three  2000.0     NaN    NaN
         two       NaN  1000.0    NaN

In [28]:
t=pd.pivot_table(df,values='price',index=['category','items'],columns=['size'],aggfunc=np.min)
t

size             large  medium  small
category items
a        four      NaN  1500.0    NaN
         three     NaN     NaN  800.0
         two    2500.0     NaN    NaN
b        four      NaN     NaN  400.0
         three  2000.0     NaN    NaN
         two       NaN  1000.0    NaN

In [31]:
t=pd.pivot_table(df,values='price',index=['category','items'],columns=['size'],aggfunc=np.max)
t

size             large  medium  small
category items
a        four      NaN  1500.0    NaN
         three     NaN     NaN  800.0
         two    3000.0     NaN    NaN
b        four      NaN     NaN  400.0
         three  2000.0     NaN    NaN
         two       NaN  1000.0    NaN

In [32]:
t=pd.pivot_table(df,values='price',index=['category','items'],columns=['size'],aggfunc=np.var)
t

size             large
category items
a        two    125000

In [33]:
t=pd.pivot_table(df,values='price',index=['category','items'],columns=['size'],aggfunc=np.std)
t

size                 large
category items
a        two    353.553391

In [34]:
t=pd.pivot_table(df,values='price',index=['category','items'],aggfunc=np.mean)
t

                price
category items
a        four    1500
         three    800
         two     2750
b        four     400
         three   2000
         two     1000

In [35]:
df=pd.read_csv("dataset1.csv")
df

      Areas      Domain    Salary
0   Medical     Surgrey  200000.0
1  Enginear       Civil  190000.0
2   Medical     Dentist  180000.0
3   Medical  Omcologist  160000.0
4  Enginear  Electrical  200000.0
5  Enginear  Mechanical  190000.0
6   Medical     Surgrey  150000.0
7       NaN         NaN       NaN

In [36]:
t=pd.pivot_table(df,values='Salary',index=['Areas','Domain'],aggfunc=np.sum)
t

                       Salary
Areas    Domain
Enginear Civil       190000.0
         Electrical  200000.0
         Mechanical  190000.0
Medical  Dentist     180000.0
         Omcologist  160000.0
         Surgrey     350000.0

In [37]:
t=pd.pivot_table(df,values='Salary',index=['Areas','Domain'],aggfunc=np.mean)
t

                       Salary
Areas    Domain
Enginear Civil       190000.0
         Electrical  200000.0
         Mechanical  190000.0
Medical  Dentist     180000.0
         Omcologist  160000.0
         Surgrey     175000.0

In [39]:
t=pd.pivot_table(df,values='Salary',index=['Areas','Domain'],aggfunc=np.var)
t

                       Salary
Areas   Domain
Medical Surgrey  1.250000e+09

In [40]:
t=pd.pivot_table(df,values='Salary',index=['Areas','Domain'],aggfunc=np.std)
t

                       Salary
Areas   Domain
Medical Surgrey  35355.339059

In [241]:
dataset={
    "area":['medical','medical',"enginear","enginear"],
    "domain":['surgery','civi','electrical','mechanica'],
    "salary":[222,333,444,555,]
}
df=pd.DataFrame(dataset)
df

       area      domain  salary
0   medical     surgery     222
1   medical        civi     333
2  enginear  electrical     444
3  enginear   mechanica     555

In [242]:
t=pd.pivot_table(df,values='salary',index=['area','domain'],aggfunc=np.sum)
t

                     salary
area     domain
enginear electrical     444
         mechanica      555
medical  civi           333
         surgery        222

In [243]:
df=pd.read_csv("studentdata.csv")
df

  dagree           subject  no_of_students
0    mcs  computer science              40
1    msc           english              35
2     bs              urdu              50
3     bs             maths              45

In [246]:
student1={
    "degree":["mcs","msc","msc","bs"],
    "subject":["computerscience","bio","english","urdu"],
    "no_of_student":[333,444,555,666]
    }
dfs=pd.DataFrame(student1)
dfs

  degree          subject  no_of_student
0    mcs  computerscience            333
1    msc              bio            444
2    msc          english            555
3     bs             urdu            666